# Exercise 4.5

## Importing libraries

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os

## Defining "path" variable

In [2]:
# defining path variable
path = r'C:\Users\khand\Desktop\Careerfoundry\Data Immersion\Achievement - 4\04-2022 Instacart Basket Analysis'

## Importing dataframes

In [3]:
# importing "orders_wrangled.csv" 
df_ords = pd.read_csv(os.path.join(path, '2. Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [4]:
# importing "products.csv"
df_prods = pd.read_csv(os.path.join(path, '2. Data', 'Original Data', 'products.csv'), index_col = False)

In [5]:
# checking data types of the "df_ords" dataframe
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_day_of_week       int64
 4   order_time_24h_format   int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(5)
memory usage: 156.6 MB

In [6]:
# checking data types of the "df_pords" dataframe
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   prices         49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

## Working with mixed datatype columns

In [7]:
# creating a dataframe
df_test = pd.DataFrame()

In [8]:
# creating a mixed datatype column in the new data frame
df_test['mix'] = ['a', 'b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [10]:
# looking for mixed type column
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [11]:
# changing the datatype for the "mixed column
df_test['mix'] = df_test['mix'].astype('str')

## Missing Values

### Finding missing values in dataframe

In [12]:
# finding the number of records/pbservations with missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
# creating new dataframe with the records with missing value
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [14]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

### Addressing missing values

In [15]:
df_prods.shape

(49693, 5)

In [16]:
# creating a new dataframe excluding the records with missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [17]:
df_prods_clean.shape

(49677, 5)

## Duplicate values

### Finding duplicate values

In [18]:
# filtering the full duplicate records
df_prods_clean[df_prods_clean.duplicated()]

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
# Turning the duplicate records in to a separate dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

### Addressing duplicate values

In [20]:
df_prods_clean.shape

(49677, 5)

In [21]:
# dropping the duplicate records from the dataframe
df_prods_clean.drop_duplicates()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [22]:
# turning the unique records (without duplicates) in to a new dataframe
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [23]:
df_prods_clean_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49672 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int64
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int64
 3   department_id  49672 non-null  int64
 4   prices         49672 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 2.3+ MB

In [24]:
df_prods_clean_no_dups.shape

(49672, 5)

## Exporting the dataframe after consistency check

In [25]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '2. Data', 'Prepared Data', 'Products_checked.csv'), index = None)

# Task 4.5

## Step - 2 : Checking consistency of "df_prods" dataframe

### Changing datatypes of the identifier columns

In [25]:
# changing the datatype of the "product_id" column
df_prods_clean_no_dups['product_id'] = df_prods_clean_no_dups['product_id'].astype('str')

C:\Users\khand\AppData\Local\Temp/ipykernel_15704/109918540.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_prods_clean_no_dups['product_id'] = df_prods_clean_no_dups['product_id'].astype('str')

In [26]:
# changing the datatype of the "aisle_id" column
df_prods_clean_no_dups['aisle_id'] = df_prods_clean_no_dups['aisle_id'].astype('str')

C:\Users\khand\AppData\Local\Temp/ipykernel_15704/3701837081.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_prods_clean_no_dups['aisle_id'] = df_prods_clean_no_dups['aisle_id'].astype('str')

In [27]:
# changing the datatype of the "department_id" column
df_prods_clean_no_dups['department_id'] = df_prods_clean_no_dups['department_id'].astype('str')

C:\Users\khand\AppData\Local\Temp/ipykernel_15704/657017535.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_prods_clean_no_dups['department_id'] = df_prods_clean_no_dups['department_id'].astype('str')

### Descriptive analysis of "df_prods" dataframe

In [28]:
# descriptive analysis of 'df_prods_clean_no_dups' dataframe
df_prods_clean_no_dups.describe()

             prices
count  49672.000000
mean       9.993282
std      453.615536
min        1.000000
25%        4.100000
50%        7.100000
75%       11.100000
max    99999.000000

#### the maximum value in the 'prices' column is 99999.00 which is too high compared to the mean and quartiles

In [29]:
# checking data types
df_prods_clean_no_dups.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49672 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  object
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  object
 3   department_id  49672 non-null  object
 4   prices         49672 non-null  float64
dtypes: float64(1), object(4)
memory usage: 2.3+ MB

## Step-3 & 4: finding cilumns with mixed datatypes in "df_ords" dataframe

### Looking for columns with mixed datatype values in "df_ords" dataframe

In [30]:
# Printing column names of columns with mixed datatype values
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

#### No columns with mixed datatype values in "df_ords" dataframe

## Step-5&6: Looking for missing values in "df_ords" dataframe

In [31]:
# looking for number of records with missing values in each column
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_time_24h_format          0
days_since_prior_order    206209
dtype: int64

#### 206209 missing values in "days_since_prior_order" column of "df_ords" dataframe

In [32]:
# Filtering the records with missing value in 'days_since_prior_order' column
df_ords[df_ords['days_since_prior_order'].isnull()]

,order_id,user_id,order_number,order_day_of_week,order_time_24h_format,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [33]:
# Turning the records with missing value in 'days_since_prior_order' column into a new data frame
df_ords_missing = df_ords[df_ords['days_since_prior_order'].isnull()]

In [34]:
# Descriptive analysis of the "df_ords_missing" dataframe
df_ords_missing.describe()

,order_id,user_id,order_number,order_day_of_week,order_time_24h_format,days_since_prior_order
count,2.062090e+05,206209.000000,206209.0,206209.000000,206209.000000,0.0
mean,1.708462e+06,103105.000000,1.0,2.754118,13.626597,NaN
std,9.881299e+05,59527.555167,0.0,2.076205,4.223769,NaN
min,2.000000e+01,1.000000,1.0,0.000000,0.000000,NaN
25%,8.507300e+05,51553.000000,1.0,1.000000,11.000000,NaN
50%,1.706246e+06,103105.000000,1.0,3.000000,14.000000,NaN
75%,2.564292e+06,154657.000000,1.0,5.000000,17.000000,NaN
max,3.421081e+06,206209.000000,1.0,6.000000,23.000000,NaN

#### maximum, minimum, quartiles and mean = 1 for the "order_number" column, standard deviation is 0. We need to look deeper into this column.

In [35]:
# looking into the frequency distribution of the values in the "order_number" column in "df_ords_missing" dataframe
df_ords_missing['order_number'].value_counts(dropna = False)

1    206209
Name: order_number, dtype: int64

####  The records with the missing values are the first ever order by different users. Hence, there are no prior orders to find a duration in between. Therefore, keeping the missing values as they are.

In [36]:
# Checking value counts of the "days_since_prior_order" column
df_ords['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

## Step-7 & 8: Looking for duplicate data in "df_ords" dataframe

In [37]:
df_ords[df_ords.duplicated()]

Empty DataFrame
Columns: [order_id, user_id, order_number, order_day_of_week, order_time_24h_format, days_since_prior_order]
Index: []

## Changing data types of categorical columns

In [38]:
# datatypes in the "df_ords" dataframe
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_day_of_week       int64
 4   order_time_24h_format   int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(5)
memory usage: 156.6 MB

In [39]:
# changing data types
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [40]:
# changing datatype
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [43]:
# cheching datatypes
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   order_day_of_week       object
 4   order_time_24h_format   object
 5   days_since_prior_order  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 156.6+ MB

## Step-9: Exporting the dataframes

In [44]:
# exporting "df_prods_clean_no_dups" dataframe
df_prods_clean_no_dups.to_csv(os.path.join(path, '2. Data', 'Prepared Data', 'Products_checked.csv'), index = None)

In [45]:
# exporting "df_ords" dataframe
df_ords.to_csv(os.path.join(path, '2. Data', 'Prepared Data', 'Orders_checked.csv'), index = None)